
= Patient Information
:neo4j-version: 2.0.0-RC1
:author: Scott LePage
:tags: domain:healthcare, use-case:patient information


'''

*Table of Contents*

* *Database Setup*
** <<sample_data_set, Sample Data Set>>

'''

== Sample Data Set

//setup
[source,cypher]
----

// Create persons
CREATE (person1:Person { 
       		FirstName: "John", 
       		LastName: "Smith", 
       		DOB: "1/1/1950",
       		Gender: "M",
       		Ethnicity: "Caucasian"})
       		
CREATE (person2:Person { 
       		FirstName: "Beverly", 
       		LastName: "Smith"}) 

CREATE (person3:Person { 
		FirstName: "Vera", 
		LastName: "Wang",
       		DOB: "2/2/1970",
       		Gender: "F",
       		Ethnicity: "Chinese"}) 
		
CREATE (person4:Person { 
       		FirstName: "Tony", 
       		LastName: "Wang" 
       		}) 
       		
CREATE (person5:Person { 
			FirstName: "Michael", 
			LastName: "Davies", 
			UniqueId: "910001" }) 
			
CREATE (person6:Person { 
			FirstName: "Stacy", 
			LastName: "Mulder", 
			UniqueId: "910002" })

CREATE (patient1:Patient {
       			UniqueId: "0111111" })
       			
CREATE (patient2:Patient {
       			UniqueId: "0222222" })
			
CREATE (physician1:Physician { 
			UniqueId: "910001",
			Rank: "Associate Professor",
			Title: "M.D., Ph.D." })
			
CREATE (physician2:Physician { 
			UniqueId: "910002",
			Rank: "Associate Professor",
			Title: "M.D., M.S.C.I." })

// Create Address
CREATE (address1:Address { 
			Street: "1301 S. Braeswood Blvd.", 
			City: "Houston", 
			State: "Tx" })
			
CREATE (diagnosis1:Diagnosis { 
			Name: "Melanoma", 
			Stage: "2"})
			
CREATE (diagnosis2:Diagnosis { 
			Name: "Breast Cancer", 
			Stage: "1"})
			
// Connect spouses
CREATE (person1)-[:SPOUSE_OF]->(person2)-[:SPOUSE_OF]->(person1), 
       (person3)-[:SPOUSE_OF]->(person4)-[:SPOUSE_OF]->(person3)

// Create Phone Number
CREATE (phoneNumber1:PhoneNumber { PhoneNumber: "512-123-5678" })
CREATE (phoneNumber2:PhoneNumber { PhoneNumber: "832-123-5677" })

CREATE 	(person2)-[:HAS_PHONENUMBER]->(phoneNumber1), 
       	(person4)-[:HAS_PHONENUMBER]->(phoneNumber2),
       	(patient1)-[:HAS_ADDRESS]->(address1)
       
CREATE 	(person1)-[:IS_A]->(patient1),
	(person3)-[:IS_A]->(patient2),
	(person5)-[:IS_A]->(physician1),
	(person6)-[:IS_A]->(physician2)
	
CREATE 	(patient1)-[:IS_A_PATIENT_OF]->(physician1)-[:CAREGIVER_FOR]->(patient1),
	(patient2)-[:IS_A_PATIENT_OF]->(physician2)-[:CAREGIVER_FOR]->(patient2)
	
CREATE 	(patient1)-[:DIAGNOSIS_OF]->(diagnosis1),
	(patient2)-[:DIAGNOSIS_OF]->(diagnosis2)

RETURN *
----

//graph

'''

== Entity Link Analysis

Performing entity link analysis on the above data model is demonstrated below.

==== Find all patients

[source,cypher]
----
MATCH 		(patient:Patient) 
RETURN 		patient
----

//output
//table

==== Find all patients with Melanoma

[source,cypher]
----
MATCH 		(diagnosis:Diagnosis {name: 'Melanoma'} )<-[:DIAGNOSIS_OF]-(patient:Patient) 
RETURN 		patient
----

//output
//table

